In [1]:
import pandas as pd

In [2]:
dataset=pd.read_csv("E:\\UDemy Data Analytics\\Complete-Python-Bootcamp-main\\Complete-Python-Bootcamp-main\\10-Data Analysis With Python\\data.csv")
dataset.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [4]:
dataset.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [5]:
dataset.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [6]:
dataset.isnull().any()

Date        False
Category    False
Value        True
Product     False
Sales        True
Region      False
dtype: bool

In [7]:
dataset.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [8]:
df_filled=dataset.fillna(0)

In [10]:
dataset['Sales_fillNA']=dataset['Sales'].fillna(dataset['Sales'].mean())
dataset

          Date Category  Value   Product  Sales Region  Sales_fillNA
0   2023-01-01        A   28.0  Product1  754.0   East    754.000000
1   2023-01-02        B   39.0  Product3  110.0  North    110.000000
2   2023-01-03        C   32.0  Product2  398.0   East    398.000000
3   2023-01-04        B    8.0  Product1  522.0   East    522.000000
4   2023-01-05        B   26.0  Product3  869.0  North    869.000000
5   2023-01-06        B   54.0  Product3  192.0   West    192.000000
6   2023-01-07        A   16.0  Product1  936.0   East    936.000000
7   2023-01-08        C   89.0  Product1  488.0   West    488.000000
8   2023-01-09        C   37.0  Product3  772.0   West    772.000000
9   2023-01-10        A   22.0  Product2  834.0   West    834.000000
10  2023-01-11        B    7.0  Product1  842.0  North    842.000000
11  2023-01-12        B   60.0  Product2    NaN   West    557.130435
12  2023-01-13        A   70.0  Product3  628.0  South    628.000000
13  2023-01-14        A   69.0  Product1  423.0   East    423.000000
14  2023-01-15        A   47.0  Product2  893.0   West    893.000000
15  2023-01-16        C    NaN  Product1  895.0  North    895.000000
16  2023-01-17        C   93.0  Product2  511.0  South    511.000000
17  2023-01-18        C    NaN  Product1  108.0   West    108.000000
18  2023-01-19        A   31.0  Product2  578.0   West    578.000000
19  2023-01-20        A   59.0  Product1  736.0   East    736.000000
20  2023-01-21        C   82.0  Product3  606.0  South    606.000000
21  2023-01-22        C   37.0  Product2  992.0  South    992.000000
22  2023-01-23        B   62.0  Product3  942.0  North    942.000000
23  2023-01-24        C   92.0  Product2  342.0   West    342.000000
24  2023-01-25        A   24.0  Product2  458.0   East    458.000000
25  2023-01-26        C   95.0  Product1  584.0   West    584.000000
26  2023-01-27        C   71.0  Product2  619.0  North    619.000000
27  2023-01-28        C   56.0  Product2  224.0  North    224.000000
28  2023-01-29        B    NaN  Product3  617.0  North    617.000000
29  2023-01-30        C   51.0  Product2  737.0  South    737.000000
30  2023-01-31        B   50.0  Product3  735.0   West    735.000000
31  2023-02-01        A   17.0  Product2  189.0   West    189.000000
32  2023-02-02        B   63.0  Product3  338.0  South    338.000000
33  2023-02-03        C   27.0  Product3    NaN   East    557.130435
34  2023-02-04        C   70.0  Product3  669.0   West    669.000000
35  2023-02-05        B   60.0  Product2    NaN   West    557.130435
36  2023-02-06        C   36.0  Product3  177.0   East    177.000000
37  2023-02-07        C    2.0  Product1    NaN  North    557.130435
38  2023-02-08        C   94.0  Product1  408.0  South    408.000000
39  2023-02-09        A   62.0  Product1  155.0   West    155.000000
40  2023-02-10        B   15.0  Product1  578.0   East    578.000000
41  2023-02-11        C   97.0  Product1  256.0   East    256.000000
42  2023-02-12        A   93.0  Product3  164.0   West    164.000000
43  2023-02-13        A   43.0  Product3  949.0   East    949.000000
44  2023-02-14        A   96.0  Product3  830.0   East    830.000000
45  2023-02-15        B   99.0  Product2  599.0   West    599.000000
46  2023-02-16        B    6.0  Product1  938.0  South    938.000000
47  2023-02-17        B   69.0  Product3  143.0   West    143.000000
48  2023-02-18        C   65.0  Product3  182.0  North    182.000000
49  2023-02-19        C   11.0  Product3  708.0  North    708.000000

In [11]:
dataset.dtypes

Date             object
Category         object
Value           float64
Product          object
Sales           float64
Region           object
Sales_fillNA    float64
dtype: object

In [12]:
dataset= dataset.rename(columns={'Date':'Sales Date'})
dataset.head()

   Sales Date Category  Value   Product  Sales Region  Sales_fillNA
0  2023-01-01        A   28.0  Product1  754.0   East         754.0
1  2023-01-02        B   39.0  Product3  110.0  North         110.0
2  2023-01-03        C   32.0  Product2  398.0   East         398.0
3  2023-01-04        B    8.0  Product1  522.0   East         522.0
4  2023-01-05        B   26.0  Product3  869.0  North         869.0

In [16]:
dataset['Value_new']=dataset['Value'].fillna(dataset['Value'].mean()).astype(int)
dataset

,Sales Date,Category,Value,Product,Sales,Region,Sales_fillNA,Value_new
0,2023-01-01,A,28.0,Product1,754.0,East,754.000000,28
1,2023-01-02,B,39.0,Product3,110.0,North,110.000000,39
2,2023-01-03,C,32.0,Product2,398.0,East,398.000000,32
3,2023-01-04,B,8.0,Product1,522.0,East,522.000000,8
4,2023-01-05,B,26.0,Product3,869.0,North,869.000000,26
5,2023-01-06,B,54.0,Product3,192.0,West,192.000000,54
6,2023-01-07,A,16.0,Product1,936.0,East,936.000000,16
7,2023-01-08,C,89.0,Product1,488.0,West,488.000000,89
8,2023-01-09,C,37.0,Product3,772.0,West,772.000000,37
9,2023-01-10,A,22.0,Product2,834.0,West,834.000000,22
10,2023-01-11,B,7.0,Product1,842.0,North,842.000000,7
11,2023-01-12,B,60.0,Product2,NaN,West,557.130435,60
12,2023-01-13,A,70.0,Product3,628.0,South,628.000000,70
13,2023-01-14,A,69.0,Product1,423.0,East,423.000000,69
14,2023-01-15,A,47.0,Product2,893.0,West,893.000000,47
15,2023-01-16,C,NaN,Product1,895.0,North,895.000000,51
16,2023-01-17,C,93.0,Product2,511.0,South,511.000000,93
17,2023-01-18,C,NaN,Product1,108.0,West,108.000000,51
18,2023-01-19,A,31.0,Product2,578.0,West,578.000000,31
19,2023-01-20,A,59.0,Product1,736.0,East,736.000000,59
20,2023-01-21,C,82.0,Product3,606.0,South,606.000000,82
21,2023-01-22,C,37.0,Product2,992.0,South,992.000000,37
22,2023-01-23,B,62.0,Product3,942.0,North,942.000000,62
23,2023-01-24,C,92.0,Product2,342.0,West,342.000000,92
24,2023-01-25,A,24.0,Product2,458.0,East,458.000000,24
25,2023-01-26,C,95.0,Product1,584.0,West,584.000000,95
26,2023-01-27,C,71.0,Product2,619.0,North,619.000000,71
27,2023-01-28,C,56.0,Product2,224.0,North,224.000000,56
28,2023-01-29,B,NaN,Product3,617.0,North,617.000000,51
29,2023-01-30,C,51.0,Product2,737.0,South,737.000000,51
30,2023-01-31,B,50.0,Product3,735.0,West,735.000000,50
31,2023-02-01,A,17.0,Product2,189.0,West,189.000000,17
32,2023-02-02,B,63.0,Product3,338.0,South,338.000000,63
33,2023-02-03,C,27.0,Product3,NaN,East,557.130435,27
34,2023-02-04,C,70.0,Product3,669.0,West,669.000000,70
35,2023-02-05,B,60.0,Product2,NaN,West,557.130435,60
36,2023-02-06,C,36.0,Product3,177.0,East,177.000000,36
37,2023-02-07,C,2.0,Product1,NaN,North,557.130435,2
38,2023-02-08,C,94.0,Product1,408.0,South,408.000000,94
39,2023-02-09,A,62.0,Product1,155.0,West,155.000000,62
40,2023-02-10,B,15.0,Product1,578.0,East,578.000000,15
41,2023-02-11,C,97.0,Product1,256.0,East,256.000000,97
42,2023-02-12,A,93.0,Product3,164.0,West,164.000000,93
43,2023-02-13,A,43.0,Product3,949.0,East,949.000000,43
44,2023-02-14,A,96.0,Product3,830.0,East,830.000000,96
45,2023-02-15,B,99.0,Product2,599.0,West,599.000000,99
46,2023-02-16,B,6.0,Product1,938.0,South,938.000000,6
47,2023-02-17,B,69.0,Product3,143.0,West,143.000000,69
48,2023-02-18,C,65.0,Product3,182.0,North,182.000000,65
49,2023-02-19,C,11.0,Product3,708.0,North,708.000000,11

In [19]:
dataset['New Value']=dataset['Value'].apply(lambda x:x**2)
dataset.head()

,Sales Date,Category,Value,Product,Sales,Region,Sales_fillNA,Value_new,New Value
0,2023-01-01,A,28.0,Product1,754.0,East,754.0,28,784.0
1,2023-01-02,B,39.0,Product3,110.0,North,110.0,39,1521.0
2,2023-01-03,C,32.0,Product2,398.0,East,398.0,32,1024.0
3,2023-01-04,B,8.0,Product1,522.0,East,522.0,8,64.0
4,2023-01-05,B,26.0,Product3,869.0,North,869.0,26,676.0

In [21]:
grouped_mean=dataset.groupby('Product')['Value'].mean()
print(grouped_mean)

Product
Product1    46.214286
Product2    52.800000
Product3    55.166667
Name: Value, dtype: float64

In [22]:
grouped_sum=dataset.groupby(['Product','Region'])['Value'].sum()
print(grouped_sum)

Product   Region
Product1  East      292.0
          North       9.0
          South     100.0
          West      246.0
Product2  East       56.0
          North     127.0
          South     181.0
          West      428.0
Product3  East      202.0
          North     203.0
          South     215.0
          West      373.0
Name: Value, dtype: float64

In [24]:
grouped_mean=dataset.groupby(['Product','Region'])['Value'].mean()
grouped_mean

Product   Region
Product1  East      41.714286
          North      4.500000
          South     50.000000
          West      82.000000
Product2  East      28.000000
          North     63.500000
          South     60.333333
          West      53.500000
Product3  East      50.500000
          North     40.600000
          South     71.666667
          West      62.166667
Name: Value, dtype: float64

In [25]:
grouped_agg=dataset.groupby('Region')['Value'].agg(['mean','sum','count'])
grouped_agg

             mean     sum  count
Region
East    42.307692   550.0     13
North   37.666667   339.0      9
South   62.000000   496.0      8
West    61.588235  1047.0     17

In [41]:
df1 = pd.DataFrame({'Key':['A','B','C'], 'Value1':[1,2,3]})
df2 = pd.DataFrame({'Key':['C', 'E', 'F'], 'Value2':[4,5,6]})

In [42]:
df1

  Key  Value1
0   A       1
1   B       2
2   C       3

In [43]:
df2

  Key  Value2
0   C       4
1   E       5
2   F       6

In [44]:
pd.merge(df1,df2,on='Key',how='inner')

  Key  Value1  Value2
0   C       3       4

In [45]:
pd.merge(df1,df2,on='Key',how='outer')

  Key  Value1  Value2
0   A     1.0     NaN
1   B     2.0     NaN
2   C     3.0     4.0
3   E     NaN     5.0
4   F     NaN     6.0

In [46]:
pd.merge(df1,df2,on='Key',how='left')

  Key  Value1  Value2
0   A       1     NaN
1   B       2     NaN
2   C       3     4.0

In [47]:
pd.merge(df1,df2,on='Key',how='right')

  Key  Value1  Value2
0   C     3.0       4
1   E     NaN       5
2   F     NaN       6

In [50]:
from io import StringIO
Data = '{"employee_name": "James", "email":"james@gmail.com", "job_profile": [{"title1":"Team Lead", "title2":"Sr. Developer"}]}'
df=pd.read_json(StringIO(Data))

In [51]:
df

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [52]:
df.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [53]:
df.to_json(orient='index')

'{"0":{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

In [54]:
df.to_json(orient='records')

'[{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}]'

In [59]:
df=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data', header=None)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [61]:
df.to_csv("wine.csv")

In [63]:
!pip install lxml

Collecting lxml
  Downloading lxml-6.0.0-cp312-cp312-win_amd64.whl.metadata (6.8 kB)
Downloading lxml-6.0.0-cp312-cp312-win_amd64.whl (4.0 MB)
   ---------------------------------------- 0.0/4.0 MB ? eta -:--:--
   ---------------------------------------- 0.0/4.0 MB ? eta -:--:--
   ---------------------------------------- 0.0/4.0 MB ? eta -:--:--
   ---------------------------------------- 0.0/4.0 MB ? eta -:--:--
   -- ------------------------------------- 0.3/4.0 MB ? eta -:--:--
   -- ------------------------------------- 0.3/4.0 MB ? eta -:--:--
   ----- ---------------------------------- 0.5/4.0 MB 730.2 kB/s eta 0:00:05
   ------- -------------------------------- 0.8/4.0 MB 987.4 kB/s eta 0:00:04
   ---------- ----------------------------- 1.0/4.0 MB 1.1 MB/s eta 0:00:03
   ------------- -------------------------- 1.3/4.0 MB 1.2 MB/s eta 0:00:03
   --------------- ------------------------ 1.6/4.0 MB 1.2 MB/s eta 0:00:03
   --------------- ------------------------ 1.6/4.0 MB 1.2 MB/s eta 0:00:03
   ------------------ --------------------- 1.8/4.0 MB 1.0 MB/s eta 0:00:03
   ------------------ --------------------- 1.8/4.0 MB 1.0 MB/s eta 0:00:03
   ------------------ --------------------- 1.8/4.0 MB 1.0 MB/s eta 0:00:03
   ------------------ --------------------- 1.8/4.0 MB 1.0 MB/s eta 0:00:03
   -------------------- ------------------- 2.1/4.0 MB 752.7 kB/s eta 0:00:03
   -------------------- ------------------- 2.1/4.0 MB 752.7 kB/s eta 0:00:03
   -------------------- ------------------- 2.1/4.0 MB 752.7 kB/s eta 0:00:03
   -------------------- ------------------- 2.1/4.0 MB 752.7 kB/s eta 0:00:03
   -------------------- ------------------- 2.1/4.0 MB 752.7 kB/s eta 0:00:03
   ----------------------- ---------------- 2.4/4.0 MB 601.9 kB/s eta 0:00:03
   ----------------------- ---------------- 2.4/4.0 MB 601.9 kB/s eta 0:00:03
   ---------------------------- ----------- 2.9/4.0 MB 650.3 kB/s eta 0:00:02
   ---------------------------- ----------- 2.9/4.0 MB 650.3 kB/s eta 0:00:02
   ------------------------------- -------- 3.1/4.0 MB 663.8 kB/s eta 0:00:02
   ------------------------------------ --- 3.7/4.0 MB 744.4 kB/s eta 0:00:01
   ---------------------------------------- 4.0/4.0 MB 790.0 kB/s eta 0:00:00
Installing collected packages: lxml
Successfully installed lxml-6.0.0

[notice] A new release of pip is available: 24.2 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [64]:
!pip install html5lib
!pip install beautifulsoup4

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl.metadata (16 kB)
Requirement already satisfied: six>=1.9 in e:\code\venv\lib\site-packages (from html5lib) (1.17.0)
Collecting webencodings (from html5lib)
  Downloading webencodings-0.5.1-py2.py3-none-any.whl.metadata (2.1 kB)
Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
Downloading webencodings-0.5.1-py2.py3-none-any.whl (11 kB)
Installing collected packages: webencodings, html5lib
Successfully installed html5lib-1.1 webencodings-0.5.1

[notice] A new release of pip is available: 24.2 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Collecting beautifulsoup4
  Downloading beautifulsoup4-4.13.4-py3-none-any.whl.metadata (3.8 kB)
Collecting soupsieve>1.2 (from beautifulsoup4)
  Downloading soupsieve-2.7-py3-none-any.whl.metadata (4.6 kB)
Collecting typing-extensions>=4.0.0 (from beautifulsoup4)
  Downloading typing_extensions-4.14.1-py3-none-any.whl.metadata (3.0 kB)
Downloading beautifulsoup4-4.13.4-py3-none-any.whl (187 kB)
Downloading soupsieve-2.7-py3-none-any.whl (36 kB)
Downloading typing_extensions-4.14.1-py3-none-any.whl (43 kB)
Installing collected packages: typing-extensions, soupsieve, beautifulsoup4
Successfully installed beautifulsoup4-4.13.4 soupsieve-2.7 typing-extensions-4.14.1

[notice] A new release of pip is available: 24.2 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [85]:
url='https://www.fdic.gov/bank-failures/failed-bank-list'

df=pd.read_html(url)

In [86]:
df[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
5,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
6,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
7,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
8,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
9,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538

In [75]:
url="https://en.wikipedia.org/wiki/Mobile_country_code"
pd.read_html(url,match='Country',header=0)[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

In [93]:
%pip install openpyxl

Requirement already satisfied: openpyxl in e:\code\venv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in e:\code\venv\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [92]:
df_excel=pd.read_excel('E:\\UDemy Data Analytics\\Complete-Python-Bootcamp-main\\Complete-Python-Bootcamp-main\\10-Data Analysis With Python\\data.xlsx')
df_excel

    Name  Age
0  Krish   32
1   Jack   34
2   John   31

In [94]:
df_excel.to_pickle('df_excel')

In [95]:
pd.read_pickle('df_excel')

    Name  Age
0  Krish   32
1   Jack   34
2   John   31